import { Question } from './types';

export const QUESTIONS: Question[] = [
  {
    id: 1,
    text: "क्या आप बच्चे को देखकर मुस्कुराते हो?",
    subText: "(जैसे स्कूल से आए, बाहर जा रहा हो, या बस यूँ ही)",
    category: 'warmth'
  },
  {
    id: 2,
    text: "क्या आप बच्चे की तारीफ़ करते हो?",
    subText: "(जब वो आपकी, दूसरों की मदद करे, कुछ अच्छा करे या गलती मान ले)",
    category: 'warmth'
  },
  {
    id: 3,
    text: "क्या आप जरूरत पड़ने पर बच्चे की मदद करते हो?",
    subText: "(जैसे स्कूल प्रोजेक्ट, या किसी परेशानी में)",
    category: 'warmth'
  },
  {
    id: 4,
    text: "क्या आप बच्चे के साथ समय बिताते हो?",
    category: 'warmth'
  },
  {
    id: 5,
    text: "बच्चा उदास हो तो क्या आप उसे बेहतर महसूस कराते हो?",
    subText: "(पसंद की चीज़ बनाना, बाहर ले जाना या बात कर समझना)",
    category: 'warmth'
  },
  {
    id: 6,
    text: "बच्चा तकलीफ़ में हो तो क्या सबसे पहले आपके पास आता है?",
    category: 'warmth'
  },
  {
    id: 7,
    text: "क्या आप बच्चे को उसकी पसंद का काम करने देते हो?",
    subText: "(दोस्तों संग खेलना, बाहर जाना, गेम खेलना, एक्टिविटी जॉइन करना)",
    category: 'warmth'
  },
  {
    id: 8,
    text: "क्या आप बच्चे को अपने फैसले लेने देते हो?",
    subText: "(कहाँ जाए, क्या खाए, क्या पहने, कौन-सी स्ट्रीम चुने, दोस्ती आदि)",
    category: 'warmth'
  },
  {
    id: 9,
    text: "क्या आपको लगता है कि आपके बिना बच्चा खुद की देखभाल नहीं कर पाता?",
    subText: "(लोगों से बात करना, मदद माँगना, अपने काम करना)",
    category: 'control'
  },
  {
    id: 10,
    text: "क्या आपके पति/पत्नी बच्चे के साथ ज़रूरत से ज़्यादा सख्त होते हैं?",
    subText: "(छोटी-छोटी बातों पर डाँटना, मना करना, हर चीज़ में गलतियाँ निकालना)",
    category: 'control'
  },
  {
    id: 11,
    text: "क्या आप बार-बार बच्चे को डाँटते हो?",
    subText: "(छोटी गलतियों पर, हर चीज़ में रोकना-टोकना)",
    category: 'control'
  },
  {
    id: 12,
    text: "जब आपके पति/पत्नी बच्चे को डाँटें, तो क्या आप या घर वाले उसे दिलासा देते हो?",
    subText: "(जैसे कहना — “तेरी गलती नहीं है” आदि)",
    category: 'support'
  },
  {
    id: 13,
    text: "क्या आप बच्चे की गतिविधियों पर ज़्यादा नियंत्रण रखते हो?",
    subText: "(कहाँ जाए, किससे बात करे, किसके साथ घूमे, कब सोए और बाकी नियम)",
    category: 'control'
  },
  {
    id: 14,
    text: "बच्चा गलत व्यवहार करे तो क्या आप बहुत गुस्सा हो जाते हो?",
    subText: "(मारना, खाना रोकना, कमरे में बंद करना, बाहर न जाने देना आदि)",
    category: 'control'
  }
];